using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MusicEShop.Domain.DTOs
{
    public static class MenuTextData
    {
        public static readonly string LoginMenuText =
@"-----------------------------
| #   | Pasirinkimas         |
------------------------------ 
| 1.  | Prisijungti          |
------------------------------
| 2.  | Registruotis         |
------------------------------
| 3.  | Darbuotojų Parinktys |
------------------------------";

        public static readonly string CustomerMenuText =
@"---------------------------------------------- 
| #   | Pasirinkimas                          |
----------------------------------------------- 
| 1.  | Peržiūrėti katalogą                   |
-----------------------------------------------
| 2.  | Įdėti į krepšelį                      |
-----------------------------------------------
| 3.  | Peržiūrėti krepšelį                   |
-----------------------------------------------
| 4.  | Peržiūrėti pirkimų istorija (Išrašai) |
-----------------------------------------------";

        public static readonly string SortChoiceText =
@"---------------------------------------------- 
| #   | Pagal ka rikiuoti                     |
----------------------------------------------- 
| 1.  | Pavadinimas                           |
-----------------------------------------------
| 2.  | Pavadinimas atvirstine tvarka         |
-----------------------------------------------
| 3.  | Kompozitorius                         |
-----------------------------------------------
| 4.  | Zanras                                |
-----------------------------------------------
| 5.  | Kompozitorius ir albumas              |
-----------------------------------------------";

        public static readonly string SearchChoiceText =
@"---------------------------------------------- 
| #   | Pagal ka ieskoti                      |
----------------------------------------------- 
| 1.  | Id                                    |
-----------------------------------------------
| 2.  | Atlikejo vardas                       |
-----------------------------------------------
| 3.  | Kompozitorius                         |
-----------------------------------------------
| 4.  | Zanras                                |
-----------------------------------------------
| 5.  | Kompozitorius ir albumas              |
-----------------------------------------------
| 6.  | Milisekundes(Min)                     |
-----------------------------------------------
| 7.  | Milisekundes(Max)                     |
-----------------------------------------------";

        public static readonly string CartSearchChoiceText =
@"---------------------------------------------- 
| #   | Pagal ka ieskoti                      |
----------------------------------------------- 
| 1.  | Id                                    |
-----------------------------------------------
| 2.  | Pavadinamas                           |
-----------------------------------------------
| 3.  | Albumo Id                             |
-----------------------------------------------
| 4.  | Albumo pavadinimas                    |
-----------------------------------------------
";
        public static readonly string EmployeeChoiceText =
@"-------------------------------------
| #   | Pasirinkimas                 |
-------------------------------------- 
| 1.  | Gauti pirkėjų sąrašą         |
--------------------------------------
| 2.  | Pašalinti pirkėją pagal ID   |
--------------------------------------
| 3.  | Modifikuoti pirkėjo duomenis |
--------------------------------------
| 4.  | Keisti dainu statusus        |
--------------------------------------";

        public static readonly string UpdateCustomerChoice =
@"---------------------------------------------- 
| #   | Atnaujinti                            |
----------------------------------------------- 
| 1.  | Vardas                                |
-----------------------------------------------
| 2.  | Pavarde                               |
-----------------------------------------------
| 3.  | Adresas                               |
-----------------------------------------------
| 4.  | Elektroninis pastas                   |
-----------------------------------------------
| 5.  | Telefono numeris                      |
-----------------------------------------------";
    }
}
